import 'dart:math';
import 'package:bloc/bloc.dart';
import 'package:faleh_hafez/domain/omen_model.dart';
import 'package:flutter/material.dart';

part 'omen_list_event.dart';
part 'omen_list_state.dart';

List<Omen> omenList = [
  //* good omens

  // 1
  Omen(
    poemText:
        'می خواه و گل افشان کن از دهر چه می‌جویی \n این گفت سحرگه گل بلبل تو چه می‌گویی \n مسند به گلستان بر تا شاهد و ساقی را \n لب گیری و رخ بوسی می نوشی و گل بویی \n شمشاد خرامان کن و آهنگ گلستان کن \n تا سرو بیاموزد از قد تو دلجویی \n تا غنچه خندانت دولت به که خواهد داد \n ای شاخ گل رعنا از بهر که می‌رویی \n امروز که بازارت پرجوش خریدار است \n دریاب و بنه گنجی از مایه نیکویی \n چون شمع نکورویی در رهگذر باد است \n طرف هنری بربند از شمع نکورویی \n آن طره که هر جعدش صد نافه چین ارزد \n خوش بودی اگر بودی بوییش ز خوش خویی \n هر مرغ به دستانی در گلشن شاه آمد \n بلبل به نواسازی حافظ به غزل گویی',
    omenText:
        'همای سعادت در آسمان شما به پرواز درآمده و زندگی بر وفق مراد است. گردش روزگار به کام دل شما است و اگر خوب نگاه کنید گلستانی از معرفت را در اطراف خود خواهید دید. در این دوران که عشق شما خریدار دارد به خود بجنبید که فردا ممکن است دیر شود. اخلاق نیکو و مهربانی باعث شده دیگران به سمت شما جذب شده و طرفداران زیادی دارید.',
  ),

  // 2
  Omen(
    poemText:
        'به چشم کرده‌ام ابروی ماه سیمایی\n خیال سبزخطی نقش بسته‌ام جایی\n امید هست که منشور عشقبازی من\n از آن کمانچه ابرو رسد به طغرایی\n سرم ز دست بشد چشم از انتظار بسوخت\n در آرزوی سر و چشم مجلس آرایی\n مکدر است دل آتش به خرقه خواهم زد\n بیا ببین که که را می‌کند تماشایی\n به روز واقعه تابوت ما ز سرو کنید\n که می‌رویم به داغ بلندبالایی\n زمام دل به کسی داده‌ام من درویش\n که نیستش به کس از تاج و تخت پروایی\n در آن مقام که خوبان ز غمزه تیغ زنند\n عجب مدار سری اوفتاده در پایی\n مرا که از رخ او ماه در شبستان است\n کجا بود به فروغ ستاره پروایی\n فراق و وصل چه باشد رضای دوست طلب\n که حیف باشد از او غیر او تمنایی\n درر ز شوق برآرند ماهیان به نثار\n اگر سفینه حافظ رسد به دریایی ',
    omenText:
        'اگرچه به ظاهر رسیدن به مقصود دور و بعید به نظر می رسد اما همچنان امیدواری خود را حفظ کنید و بیشتر از پیش تلاش و پشتکار داشته باشید تا به مقصود برسید. با دوستان جانی و دلسوز با محبت و عشق رفتار کرده و یکرنگ و استوار باشید. برای رسیدن به مراد دل با اراده آهنین و همت عالی قدم در راه بگذارید.',
  ),

  // 3
  Omen(
    poemText:
        'ای دل گر از آن چاه زنخدان به درآیی \nهر جا که روی زود پشیمان به درآیی \nهش دار که گر وسوسه عقل کنی گوش \nآدم صفت از روضه رضوان به درآیی \nشاید که به آبی فلکت دست نگیرد \nگر تشنه لب از چشمه حیوان به درآیی \nجان می‌دهم از حسرت دیدار تو چون صبح \nباشد که چو خورشید درخشان به درآیی \nچندان چو صبا بر تو گمارم دم همت \nکز غنچه چو گل خرم و خندان به درآیی \nدر تیره شب هجر تو جانم به لب آمد \nوقت است که همچون مه تابان به درآیی \nبر رهگذرت بسته‌ام از دیده دو صد جوی \nتا بو که تو چون سرو خرامان به درآیی \nحافظ مکن اندیشه که آن یوسف مه رو \nبازآید و از کلبه احزان به درآیی',
    omenText:
        'عجولانه تصمیم نگیرید که بی فکری باعث پشیمانی و حسرت شما خواهد شد. از ظاهربینی حذر کنید و قبل از عمل کردن به حرف های دیگران عقل و اندیشه خود را به کار بگیرید. اندوه و غصه را از دل بیرون کنید و امیدوار باشید که با رفتار عاقلانه و دوراندیشی می توانید به مراد دل و مقصود خود دست پیدا کنید.',
  ),

  // 4
  Omen(
    poemText:
        'تو مگر بر لب آبی به هوس بنشینی \nور نه هر فتنه که بینی همه از خود بینی \nبه خدایی که تویی بنده بگزیده او \nکه بر این چاکر دیرینه کسی نگزینی \nگر امانت به سلامت ببرم باکی نیست \nبی دلی سهل بود گر نبود بی‌دینی \nادب و شرم تو را خسرو مه رویان کرد \nآفرین بر تو که شایسته صد چندینی \nعجب از لطف تو ای گل که نشستی با خار \nظاهرا مصلحت وقت در آن می‌بینی \nصبر بر جور رقیبت چه کنم گر نکنم \nعاشقان را نبود چاره به جز مسکینی \nباد صبحی به هوایت ز گلستان برخاست \nکه تو خوشتر ز گل و تازه‌تر از نسرینی \nشیشه بازی سرشکم نگری از چپ و راست \nگر بر این منظر بینش نفسی بنشینی \nسخنی بی‌غرض از بنده مخلص بشنو \nای که منظور بزرگان حقیقت بینی \nنازنینی چو تو پاکیزه دل و پاک نهاد \nبهتر آن است که با مردم بد ننشینی \nسیل این اشک روان صبر و دل حافظ برد \nبلغ الطاقه یا مقله عینی بینی \nتو بدین نازکی و سرکشی ای شمع چگل \nلایق بندگی خواجه جلال الدینی',
    omenText:
        'به دنبال هوا و هوس رفتن عاقبت خوشی برای شما نخواهد داشت و به شدت پشیمان می شوید. چرا زود صبر و طاقت از دست داده و خود را بی ارزش می کنید؟ قدر توانایی ها و استعدادهای خود را بدانید و در انتخاب رفیق و دوست دقت کنید که به بیراهه کشیده نشوید. برای رسیدن به مقصود باید نقاط ضعف خود را شناخته و آن ها را برطرف کنید.',
  ),

  // 5
  Omen(
    poemText:
        'ساقیا سایه ابر است و بهار و لب جوی \nمن نگویم چه کن ار اهل دلی خود تو بگوی \nبوی یک رنگی از این نقش نمی‌آید خیز \nدلق آلوده صوفی به می ناب بشوی \nسفله طبع است جهان بر کرمش تکیه مکن \nای جهان دیده ثبات قدم از سفله مجوی \nدو نصیحت کنمت بشنو و صد گنج ببر \nاز در عیش درآ و به ره عیب مپوی \nشکر آن را که دگربار رسیدی به بهار \nبیخ نیکی بنشان و ره تحقیق بجوی \nروی جانان طلبی آینه را قابل ساز \nور نه هرگز گل و نسرین ندمد ز آهن و روی \nگوش بگشای که بلبل به فغان می‌گوید \nخواجه تقصیر مفرما گل توفیق ببوی \nگفتی از حافظ ما بوی ریا می‌آید \nآفرین بر نفست باد که خوش بردی بوی',
    omenText:
        'ایام کامیابی فرا رسیده و دور گردون به کام شما می چرخد، قدر فرصت های پیش رو را بدانید. لطف و رحمت خداوند شامل حالتان می شود و لذت و شادی در زندگی تان جریان می یابد. مراقب باشید که در دوران خوشی و سرور دچار غرور و خودبینی نشوید که شادی ها ماندگار و جاودان نخواهد ماند. از این فرصت برای ساختن آینده بهتر استفاده کنید.',
  ),

  // 6
  Omen(
    poemText:
        'بلبل ز شاخ سرو به گلبانگ پهلوی \nمی‌خواند دوش درس مقامات معنوی \nیعنی بیا که آتش موسی نمود گل \nتا از درخت نکته توحید بشنوی \nمرغان باغ قافیه سنجند و بذل گوی \nتا خواجه می خورد به غزل‌های پهلوی \nجمشید جز حکایت جام از جهان نبرد \nزنهار دل مبند بر اسباب دنیوی \nاین قصه عجب شنو از بخت واژگون \nما را بکشت یار به انفاس عیسوی \nخوش وقت بوریا و گدایی و خواب امن \nکاین عیش نیست درخور اورنگ خسروی \nچشمت به غمزه خانه مردم خراب کرد \nمخموریت مباد که خوش مست می‌روی \nدهقان سالخورده چه خوش گفت با پسر \nکای نور چشم من به جز از کشته ندروی \nساقی مگر وظیفه حافظ زیاده داد \nکاشفته گشت طره دستار مولوی',
    omenText:
        'از ماست که بر ماست! هر کاری که در این دنیا انجام دهید نتیجه اش را خواهید دید پس مراقب باشید که چه می کنید و چه رفتاری دارید. انتخاب با خودتان است که طعم پیروزی را بچشید یا شکست، همگی به اعمال و رفتار شما بستگی دارد. اگر پیوسته دچار شکست می شوید باید رفتار و کارهایی که انجام داده اید را مرور کنید تا اشتباهات و نقاط ضعف خود را شناخته و آن ها را اصلاح کنید تا آینده بهتری برای خود بسازید.',
  ),

  // * bad omens

  // 1
  Omen(
    poemText:
        'صبح است و ژاله می‌چکد از ابر بهمنی \nبرگ صبوح ساز و بده جام یک منی \nدر بحر مایی و منی افتاده‌ام بیار \nمی تا خلاص بخشدم از مایی و منی \nخون پیاله خور که حلال است خون او \nدر کار یار باش که کاریست کردنی \nساقی به دست باش که غم در کمین ماست \nمطرب نگاه دار همین ره که می‌زنی \nمی ده که سر به گوش من آورد چنگ و گفت \nخوش بگذران و بشنو از این پیر منحنی \nساقی به بی‌نیازی رندان که می بده \nتا بشنوی ز صوت مغنی هوالغنی',
    omenText:
        'گاهی دچار غرور و خودبزرگ بینی می شوید و با رفیقان جانی رفتار درستی ندارید، از کبر برحذر بوده و مهرتان را نثار دوستان کنید. به جای تمرکز روی سختی ها و مشکلات زندگی و غصه خوردن برای کم و کاست دنیا، لحظه ها را با شادی بگذرانید و در کنار دوستان و خانواده با آرامش زندگی کنید.',
  ),

  // 2
  Omen(
    poemText:
        'ای که در کشتن ما هیچ مدارا نکنی \nسود و سرمایه بسوزی و محابا نکنی \nدردمندان بلا زهر هلاهل دارند \nقصد این قوم خطا باشد هان تا نکنی \nرنج ما را که توان برد به یک گوشه چشم \nشرط انصاف نباشد که مداوا نکنی \nدیده ما چو به امید تو دریاست چرا \nبه تفرج گذری بر لب دریا نکنی \nنقل هر جور که از خلق کریمت کردند \nقول صاحب غرضان است تو آن‌ها نکنی \nبر تو گر جلوه کند شاهد ما ای زاهد \nاز خدا جز می و معشوق تمنا نکنی \nحافظا سجده به ابروی چو محرابش بر \nکه دعایی ز سر صدق جز آن جا نکنی',
    omenText:
        'از تصمیمات عجولانه و بدون فکر پرهیز کنید و قبل از هر اقدامی عمیقا فکر کنید. مراقب باشید چه کارهایی از شما سرمی زند و چه حرف هایی بر زبان می آورید. بدون فکر و بی گدار به آب زدن هیچ سودی نداشته و باعث افسوس و ندامت خواهد شد. افرادی دست نیاز به سوی شما دراز کرده اند، آن ها را دریابید تا وقتی به کمک آن ها محتاج شدید به یاری تان بشتابند.',
  ),

  // 3
  Omen(
    poemText:
        'نوش کن جام شراب یک منی \nتا بدان بیخ غم از دل برکنی \nدل گشاده دار چون جام شراب \nسر گرفته چند چون خم دنی \nچون ز جام بیخودی رطلی کشی \nکم زنی از خویشتن لاف منی \nسنگسان شو در قدم نی همچو آب \nجمله رنگ آمیزی و تردامنی \nدل به می دربند تا مردانه وار \nگردن سالوس و تقوا بشکنی \nخیز و جهدی کن چو حافظ تا مگر \nخویشتن در پای معشوق افکنی',
    omenText:
        'زندگی این دنیا دو روز است و غم و شادی می آیند و می روند و هیچ چیز باقی و دائمی نیست پس غم آنچه می گذرد را نخورید. از افراد دورو و دروغ گو دوری کنید تا به دردسر نیفتید. از کبر و خودپسندی برحذر باشید زیرا نتیجه خوبی برای شما نخواهد داشت. قدر خانواده را بدانید و در کنار آن ها روزهای عمر را با لذت و شادی بگذرانید.',
  ),

  // 4
  Omen(
    poemText:
        'گفتند خلایق که تویی یوسف ثانی \nچون نیک بدیدم به حقیقت به از آنی \nشیرینتر از آنی به شکرخنده که گویم \nای خسرو خوبان که تو شیرین زمانی \nتشبیه دهانت نتوان کرد به غنچه \nهرگز نبود غنچه بدین تنگ دهانی \nصد بار بگفتی که دهم زان دهنت کام \nچون سوسن آزاده چرا جمله زبانی \nگویی بدهم کامت و جانت بستانم \nترسم ندهی کامم و جانم بستانی \nچشم تو خدنگ از سپر جان گذراند \nبیمار که دیده‌ست بدین سخت کمانی \nچون اشک بیندازیش از دیده مردم \nآن را که دمی از نظر خویش برانی',
    omenText:
        'بخت و اقبال به شما روی آورده و در آینده نزدیک به مراد دل خواهید رسید. اگر کمی پشتکار به خرج دهید می توانید همه آرزوها و اهداف خود را محقق کنید. روزهای شاد و خوبی را می گذرانید، در این ایام از کبر و غرور برحذر بوده و به فکر دیگران هم باشید. خداوند را به خاطر نعمت های سرشارش شکرگزاری کنید و قدر نعمت هایش را بدانید.',
  ),

  // 5
  Omen(
    poemText:
        'نسیم صبح سعادت بدان نشان که تو دانی \n گذر به کوی فلان کن در آن زمان که تو دانی \n تو پیک خلوت رازی و دیده بر سر راهت \n به مردمی نه به فرمان چنان بران که تو دانی \n بگو که جان عزیزم ز دست رفت خدا را \n ز لعل روح فزایش ببخش آن که تو دانی \n من این حروف نوشتم چنان که غیر ندانست \n تو هم ز روی کرامت چنان بخوان که تو دانی \n خیال تیغ تو با ما حدیث تشنه و آب است \n اسیر خویش گرفتی بکش چنان که تو دانی \n امید در کمر زرکشت چگونه ببندم \n دقیقه‌ایست نگارا در آن میان که تو دانی \n یکیست ترکی و تازی در این معامله حافظ \n حدیث عشق بیان کن بدان زبان که تو دانی',
    omenText:
        'همواره امید خود را حفظ کنید که انسان با امید می تواند پله های موفقیت را یکی پس از دیگری طی کند. ایمان خود را حفظ کنید و به خداوند توکل داشته باشید تا به ساحل نجات برسید. کمی سرگردان و آشفته شده اید، این پریشانی به خاطر دوستی با افراد جاهل و نادان است. تیزهوش و زرنگ باشید تا در معامله سودی خوبی به دست آورید.',
  ),

  // 6
  Omen(
    poemText:
        'دو یار زیرک و از باده کهن دومنی \nفراغتی و کتابی و گوشه چمنی \nمن این مقام به دنیا و آخرت ندهم \nاگر چه در پی ام افتند هر دم انجمنی \nهر آن که کنج قناعت به گنج دنیا داد \nفروخت یوسف مصری به کمترین ثمنی \nبیا که رونق این کارخانه کم نشود \nبه زهد همچو تویی یا به فسق همچو منی \nز تندباد حوادث نمی‌توان دیدن \nدر این چمن که گلی بوده است یا سمنی \nببین در آینه جام نقش بندی غیب \nکه کس به یاد ندارد چنین عجب زمنی \nاز این سموم که بر طرف بوستان بگذشت \nعجب که بوی گلی هست و رنگ نسترنی \nبه صبر کوش تو ای دل که حق رها نکند \nچنین عزیز نگینی به دست اهرمنی \nمزاج دهر تبه شد در این بلا حافظ \nکجاست فکر حکیمی و رای برهمنی',
    omenText:
        'انسان خوب و معنوی هستید و مقام و منزلت بالایی نزد خداوند دارید و حاضر نیستید آن را به توجه به مادیات یا جاه و مقام عوض کنید. قناعت و شکر پروردگار عامل سعادت دنیا و آخرت است. تاکنون از آزمایش های زیادی سربلند بیرون آمده و صبوری کرده اید. مراقب باشید که شیطان ممکن است با دسیسه های خود قصد فریب شما را داشته باشد. به خداوند پناه ببرید.',
  ),

  //* nitral omens

  // 1
  Omen(
    poemText:
        'هواخواه توام جانا و می‌دانم که می‌دانی \nکه هم نادیده می‌بینی و هم ننوشته می‌خوانی \nملامتگو چه دریابد میان عاشق و معشوق \nنبیند چشم نابینا خصوص اسرار پنهانی \nبیفشان زلف و صوفی را به پابازی و رقص آور \nکه از هر رقعه دلقش هزاران بت بیفشانی \nگشاد کار مشتاقان در آن ابروی دلبند است \nخدا را یک نفس بنشین گره بگشا ز پیشانی \nملک در سجده آدم زمین بوس تو نیت کرد \nکه در حسن تو لطفی دید بیش از حد انسانی \nچراغ افروز چشم ما نسیم زلف جانان است \nمباد این جمع را یا رب غم از باد پریشانی \nدریغا عیش شبگیری که در خواب سحر بگذشت \nندانی قدر وقت ای دل مگر وقتی که درمانی \nملول از همرهان بودن طریق کاردانی نیست \nبکش دشواری منزل به یاد عهد آسانی \nخیال چنبر زلفش فریبت می‌دهد حافظ \nنگر تا حلقه اقبال ناممکن نجنبانی',
    omenText:
        'فرصت های خوبی پیش آمده که همیشه به این راحتی پیدا نمی شود، پس قدر آن ها را بدانید و کمال استفاده را بکنید. درست است که روزهای خوش و آرامی را می گذرانید اما بهتر است به فکر ایام سختی هم باشید. دوراندیش باشید. برای جلوگیری از اشتباهات و به بیراهه نرفتن باید فکری باز و چشم حقیقت بین داشته باشید. مراقب باشید.',
  ),

  // 2
  Omen(
    poemText:
        'وقت را غنیمت دان آن قدر که بتوانی \nحاصل از حیات ای جان این دم است تا دانی \nکام بخشی گردون عمر در عوض دارد \nجهد کن که از دولت داد عیش بستانی \nباغبان چو من زین جا بگذرم حرامت باد \nگر به جای من سروی غیر دوست بنشانی \nزاهد پشیمان را ذوق باده خواهد کشت \nعاقلا مکن کاری کآورد پشیمانی \nمحتسب نمی‌داند این قدر که صوفی را \nجنس خانگی باشد همچو لعل رمانی \nبا دعای شبخیزان ای شکردهان مستیز \nدر پناه یک اسم است خاتم سلیمانی \nپند عاشقان بشنو و از در طرب بازآ \nکاین همه نمی‌ارزد شغل عالم فانی \nیوسف عزیزم رفت ای برادران رحمی \nکز غمش عجب بینم حال پیر کنعانی \nپیش زاهد از رندی دم مزن که نتوان گفت \nبا طبیب نامحرم حال درد پنهانی \nمی‌روی و مژگانت خون خلق می‌ریزد \nتیز می‌روی جانا ترسمت فرومانی \nدل ز ناوک چشمت گوش داشتم لیکن \nابروی کماندارت می‌برد به پیشانی \nجمع کن به احسانی حافظ پریشان را \nای شکنج گیسویت مجمع پریشانی \nگر تو فارغی از ما ای نگار سنگین دل \nحال خود بخواهم گفت پیش آصف ثانی',
    omenText:
        'از هدر دادن لحظات عمر برحذر باشید و ارزش روزهای زندگی را بدانید که دیگر برگشتی در کار نخواهد بود. راز دل را به افراد نامحرم نگویید که موجب حسادت آن ها شده و به دردسر می افتید. در انجام کارها از عقل و درایت خود کمک گرفته و با آرامش و بدون عجله تصمیم بگیرید. از سهل انگاری دوری کنید که به پشیمانی و شکست منتهی خواهد شد.',
  ),

  // 3
  Omen(
    poemText:
        'احمد الله علی معدله السلطان \nاحمد شیخ اویس حسن ایلخانی \nخان بن خان و شهنشاه شهنشاه نژاد \nآن که می‌زیبد اگر جان جهانش خوانی \nدیده نادیده به اقبال تو ایمان آورد \nمرحبا ای به چنین لطف خدا ارزانی \nماه اگر بی تو برآید به دو نیمش بزنند \nدولت احمدی و معجزه سبحانی \nجلوه بخت تو دل می‌برد از شاه و گدا \nچشم بد دور که هم جانی و هم جانانی \nبرشکن کاکل ترکانه که در طالع توست \nبخشش و کوشش خاقانی و چنگزخانی \nگر چه دوریم به یاد تو قدح می‌گیریم \nبعد منزل نبود در سفر روحانی \nاز گل پارسیم غنچه عیشی نشکفت \nحبذا دجله بغداد و می ریحانی \nسر عاشق که نه خاک در معشوق بود \nکی خلاصش بود از محنت سرگردانی \nای نسیم سحری خاک در یار بیار \nکه کند حافظ از او دیده دل نورانی',
    omenText:
        'اراده آهنین و محکمی دارید. بخت و اقبال به شما روی آورده و معجزه ای در شرف وقوع است که همگان را به حیرت وامی دارد. برای پیروزی در کارها باید همه تلاش خود را به کار گیرید.به زودی سفر زیارتی کربلا در پیش دارید، در طول سفر به آرامش عجیبی می رسید و اتفاقات معنوی خوبی برای شما رخ می دهد که چشم و دل تان را روشن خواهد کرد.',
  ),

  // 4
  Omen(
    poemText:
        'انت روائح رند الحمی و زاد غرامی \n فدای خاک در دوست باد جان گرامی \n پیام دوست شنیدن سعادت است و سلامت \n من المبلغ عنی الی سعاد سلامی \n بیا به شام غریبان و آب دیده من بین \n به سان باده صافی در آبگینه شامی \n اذا تغرد عن ذی الاراک طائر خیر \n فلا تفرد عن روضها انین حمامی \n بسی نماند که روز فراق یار سر آید \n رایت من هضبات الحمی قباب خیام \n خوشا دمی که درآیی و گویمت به سلامت \n قدمت خیر قدوم نزلت خیر مقام \n بعدت منک و قد صرت ذائبا کهلال \n اگر چه روی چو ماهت ندیده‌ام به تمامی \n و ان دعیت بخلد و صرت ناقض عهد \n فما تطیب نفسی و ما استطاب منامی \n امید هست که زودت به بخت نیک ببینم \n تو شاد گشته به فرماندهی و من به غلامی \n چو سلک در خوشاب است شعر نغز تو حافظ \n که گاه لطف سبق می‌برد ز نظم نظامی',
    omenText:
        'برای رسیدن به موفقیت و پیروزی در امور زندگی باید نگرانی را از خود دور کرده و صبوری پیشه کنید. انشالله در آینده نزدیک به مراد دل خواهید رسید.دل پاکی دارید، سعی کنید صداقت و درستی خود را به دیگران نشان دهید تا به شما اعتماد کرده و اطرافیان را به سمت خود جذب کنید.',
  ),

  // 5
  Omen(
    poemText:
        'سینه مالامال درد است ای دریغا مرهمی \n دل ز تنهایی به جان آمد خدا را همدمی \n چشم آسایش که دارد از سپهر تیزرو \n ساقیا جامی به من ده تا بیاسایم دمی \n زیرکی را گفتم این احوال بین خندید و گفت \n صعب روزی بوالعجب کاری پریشان عالمی \n سوختم در چاه صبر از بهر آن شمع چگل \n شاه ترکان فارغ است از حال ما کو رستمی \n در طریق عشقبازی امن و آسایش بلاست \n ریش باد آن دل که با درد تو خواهد مرهمی \n اهل کام و ناز را در کوی رندی راه نیست \n رهروی باید جهان سوزی نه خامی بی‌غمی \n آدمی در عالم خاکی نمی‌آید به دست \n عالمی دیگر بباید ساخت و از نو آدمی \n خیز تا خاطر بدان ترک سمرقندی دهیم \n کز نسیمش بوی جوی مولیان آید همی \n گریه حافظ چه سنجد پیش استغنای عشق \n کاندر این دریا نماید هفت دریا شبنمی',
    omenText:
        'صبوری در رنج و سختی ها سرانجام نتیجه خوبی می دهد و شما را به هدفی که می خواهید می رساند. امید خود را از دست ندهید و با دوستان مورد اعتماد مشورت کنید تا بهترین تصمیمات را بگیرید. از مشکلات و موانع زندگی فرار نکنید بلکه با مقاومت و سماجت از آن ها عبور نمایید. توکل به خداوند از بهترین کارهایی است که در لجظات دشوار زندگی چاره ساز است.',
  ),

  // 6
  Omen(
    poemText:
        'این خرقه که من دارم در رهن شراب اولی \n وین دفتر بی‌معنی غرق می ناب اولی \n چون عمر تبه کردم چندان که نگه کردم \n در کنج خراباتی افتاده خراب اولی \n چون مصلحت اندیشی دور است ز درویشی \n هم سینه پر از آتش هم دیده پرآب اولی \n من حالت زاهد را با خلق نخواهم گفت \n این قصه اگر گویم با چنگ و رباب اولی \n تا بی سر و پا باشد اوضاع فلک زین دست \n در سر هوس ساقی در دست شراب اولی \n از همچو تو دلداری دل برنکنم آری \n چون تاب کشم باری زان زلف به تاب اولی \n چون پیر شدی حافظ از میکده بیرون آی \n رندی و هوسناکی در عهد شباب اولی',
    omenText:
        'شکست و ناکامی در رسیدن به خواسته ها باعث اندوه زیادی شده و فکر می کنید دنیا به آخر رسیده، از غصه خوردن دست بردارید و روی کار دیگری تمرکز کنید. به زودی با تلاش و پشتکاری که دارید روزهای خوش فرا خواهد رسید. دل بستن به آرزوهای محال و ناممکن خطرناک است. به اندازه استعداد و قابلیت های خود زندگی کنید.',
  ),
];

class OmenListBloc extends Bloc<OmenListEvent, OmenListState> {
  OmenListBloc() : super(OmenListInitial()) {
    on<OmenListShowOmenEvent>((event, emit) async {
      emit(OmenListLoading());

      final Random random = Random();
      final int randomIndex = random.nextInt(omenList.length);
      final selectedOmen = omenList[randomIndex];

      await Future.delayed(
        const Duration(
          seconds: 2,
        ),
      );

      emit(
        OmenListLoaded(
          omen: selectedOmen,
        ),
      );
    });
  }
}
